In [83]:
import pandas as pd
import numpy as np

In [3]:
data = {
    "Nombre": ["Ana", "Luis", "María", "Ana", "Pedro", None],
    "Edad": [23, 35, None, 23, 40, 29],
    "Ciudad": ["CDMX", "Monterrey", "CDMX", "CDMX", "Guadalajara", "CDMX"],
    "Ingreso": [15000, 18000, 20000, 15000, None, 12000],
    "Activo": ["Sí", "No", "Sí", "Sí", "No", "Sí"]
}
df = pd.DataFrame(data)

In [7]:
df.head() # primeras 5 filas

  Nombre  Edad       Ciudad  Ingreso Activo
0    Ana  23.0         CDMX  15000.0     Sí
1   Luis  35.0    Monterrey  18000.0     No
2  María   NaN         CDMX  20000.0     Sí
3    Ana  23.0         CDMX  15000.0     Sí
4  Pedro  40.0  Guadalajara      NaN     No

In [8]:
df.tail() # ultimas 5 filas

  Nombre  Edad       Ciudad  Ingreso Activo
1   Luis  35.0    Monterrey  18000.0     No
2  María   NaN         CDMX  20000.0     Sí
3    Ana  23.0         CDMX  15000.0     Sí
4  Pedro  40.0  Guadalajara      NaN     No
5   None  29.0         CDMX  12000.0     Sí

In [11]:
df.shape

(6, 5)

In [13]:
df.columns.values

array(['Nombre', 'Edad', 'Ciudad', 'Ingreso', 'Activo'], dtype=object)

In [14]:
df.dtypes

Nombre      object
Edad       float64
Ciudad      object
Ingreso    float64
Activo      object
dtype: object

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nombre   5 non-null      object
 1   Edad     5 non-null      float64
 2   Ciudad   6 non-null      object
 3   Ingreso  5 non-null      float64
 4   Activo   6 non-null      object
dtypes: float64(2), object(3)
memory usage: 372.0+ bytes

In [24]:
df.isna().sum()

Nombre     1
Edad       1
Ciudad     0
Ingreso    1
Activo     0
dtype: int64

In [16]:
df.describe()

            Edad       Ingreso
count   5.000000      5.000000
mean   30.000000  16000.000000
std     7.483315   3082.207001
min    23.000000  12000.000000
25%    23.000000  15000.000000
50%    29.000000  15000.000000
75%    35.000000  18000.000000
max    40.000000  20000.000000

In [17]:
df['Edad']

0    23.0
1    35.0
2     NaN
3    23.0
4    40.0
5    29.0
Name: Edad, dtype: float64

In [19]:
df[df['Edad'] > 25]

  Nombre  Edad       Ciudad  Ingreso Activo
1   Luis  35.0    Monterrey  18000.0     No
4  Pedro  40.0  Guadalajara      NaN     No
5   None  29.0         CDMX  12000.0     Sí

In [21]:
df[df['Edad'] > 25].reset_index(drop = True)

  Nombre  Edad       Ciudad  Ingreso Activo
0   Luis  35.0    Monterrey  18000.0     No
1  Pedro  40.0  Guadalajara      NaN     No
2   None  29.0         CDMX  12000.0     Sí

In [26]:
df[(df['Edad'] > 25) & (df['Ingreso'].isna() == False)]

  Nombre  Edad     Ciudad  Ingreso Activo
1   Luis  35.0  Monterrey  18000.0     No
5   None  29.0       CDMX  12000.0     Sí

In [33]:
df.loc[0, "Activo"] # Por índice

'Sí'

In [34]:
df.iloc[4,2]

'Guadalajara'

In [43]:
print(df['Edad'].mean())
print(df['Edad'].max())
print(df['Edad'].min())
print(df['Edad'].median())
print(df['Edad'].nunique())
print(df['Edad'].count())

30.0
40.0
23.0
29.0
4
5

In [44]:
df['Ciudad'].value_counts()

Ciudad
CDMX           4
Monterrey      1
Guadalajara    1
Name: count, dtype: int64

In [50]:
df

  Nombre  Edad       Ciudad  Ingreso Activo
0    Ana  23.0         CDMX  15000.0     Sí
1   Luis  35.0    Monterrey  18000.0     No
2  María   NaN         CDMX  20000.0     Sí
3    Ana  23.0         CDMX  15000.0     Sí
4  Pedro  40.0  Guadalajara      NaN     No
5   None  29.0         CDMX  12000.0     Sí

In [47]:
df.sort_values(by = 'Edad', ascending = False)

  Nombre  Edad       Ciudad  Ingreso Activo
4  Pedro  40.0  Guadalajara      NaN     No
1   Luis  35.0    Monterrey  18000.0     No
5   None  29.0         CDMX  12000.0     Sí
0    Ana  23.0         CDMX  15000.0     Sí
3    Ana  23.0         CDMX  15000.0     Sí
2  María   NaN         CDMX  20000.0     Sí

In [53]:
df.groupby(['Ciudad'], as_index = False)['Ingreso'].max()

        Ciudad  Ingreso
0         CDMX  20000.0
1  Guadalajara      NaN
2    Monterrey  18000.0

### Ejemplo Práctico

In [54]:
df_cafe = pd.read_csv("cafe_sales.csv")

In [56]:
df_cafe.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11

In [58]:
df_cafe.dtypes

Transaction ID      object
Item                object
Quantity            object
Price Per Unit      object
Total Spent         object
Payment Method      object
Location            object
Transaction Date    object
dtype: object

In [59]:
df_cafe.shape

(10000, 8)

In [60]:
df_cafe.isna().sum()

Transaction ID         0
Item                 333
Quantity             138
Price Per Unit       179
Total Spent          173
Payment Method      2579
Location            3265
Transaction Date     159
dtype: int64

In [64]:
for col in df_cafe.columns:
    print(f"{col}: {df_cafe[col].nunique()}")

Transaction ID: 10000
Item: 10
Quantity: 7
Price Per Unit: 8
Total Spent: 19
Payment Method: 5
Location: 4
Transaction Date: 367

#### Limpieza Fechas

In [68]:
df_cafe['Transaction Date'] = pd.to_datetime(df_cafe['Transaction Date'], errors = 'coerce')

In [72]:
df_cafe.isna().sum()

Transaction ID         0
Item                 333
Quantity             138
Price Per Unit       179
Total Spent          173
Payment Method      2579
Location            3265
Transaction Date     460
dtype: int64

In [73]:
invalid_dates = df_cafe[df_cafe['Transaction Date'].isna()]

In [74]:
invalid_dates

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
11,TXN_3051279,Sandwich,2,4.0,8.0,Credit Card,Takeaway,NaT
29,TXN_7640952,Cake,4,3.0,12.0,Digital Wallet,Takeaway,NaT
33,TXN_7710508,UNKNOWN,5,1.0,5.0,Cash,NaN,NaT
77,TXN_2091733,Salad,1,5.0,5.0,NaN,In-store,NaT
103,TXN_7028009,Cake,4,3.0,12.0,NaN,Takeaway,NaT
...,...,...,...,...,...,...,...,...
9933,TXN_9460419,Cake,1,3.0,3.0,NaN,Takeaway,NaT
9937,TXN_8253472,Cake,1,3.0,3.0,NaN,NaN,NaT
9949,TXN_3130865,Juice,3,3.0,9.0,NaN,In-store,NaT
9983,TXN_9226047,Smoothie,3,4.0,12.0,Cash,NaN,NaT
9988,TXN_9594133,Cake,5,3.0,NaN,ERROR,NaN,NaT

#### Limpieza Items

In [89]:
df_cafe['Price Per Unit'].unique()

array([2. , 3. , 1. , 5. , 4. , 1.5, nan])

In [88]:
df_cafe['Price Per Unit'] = pd.to_numeric(df_cafe['Price Per Unit'])

In [84]:
df_cafe.loc[df_cafe['Price Per Unit'].isin(['ERROR', 'UNKNOWN']), 'Price Per Unit'] = np.nan

In [85]:
df_cafe[df_cafe['Price Per Unit'].isin(['ERROR', 'UNKNOWN'])]['Price Per Unit']

Series([], Name: Price Per Unit, dtype: object)

In [90]:
df_cafe.groupby(['Item'], as_index = False)['Price Per Unit'].mean()

       Item  Price Per Unit
0      Cake        3.000000
1    Coffee        2.000000
2    Cookie        1.000000
3     ERROR        2.944444
4     Juice        3.000000
5     Salad        5.000000
6  Sandwich        4.000000
7  Smoothie        4.000000
8       Tea        1.500000
9   UNKNOWN        2.880368